# ParameterMap Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterMap Constructor
ParameterMap Class See Also
---
Initializes a new instance of the ParameterMap class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ParameterMap()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ParameterMap()
```

# See Also
ParameterMap Class
Autodesk.Revit.DB Namespace